tap 'caskroom/cask'
brew 'bash-completion'
brew 'vim'
brew 'imagemagick' # imageutil
brew 'postgresql' # Database
brew 'nvm' # Node Version Manager
brew 'npm'
brew 'phantomjs' # handless monitor
brew 'caskroom/cask/brew-cask'

cask 'google-chrome' # browser
cask 'mou' # markdown editor
cask 'spectaclea' # window move and resize
cask 'firefox' # browser
cask 'pgadmin3'# pg util
#cask 'java' # last java sdk (1.8 rubymine bug still present)
cask 'rubymine' # ruby editor by JetBrain
cask 'anvil' # micro webserver based on pow
cask 'caffeine' # micro webserver based on pow
cask 'focus' # No more stupid website while you are working
cask 'virtualbox' # virtual machine hypervisor
cask 'vagrant' # bootstrap vms and support multiple provider to priviosin it
